app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT `tasks`.* FROM `tasks`

  def show
    @task = Task.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1

  def edit
    @task = Task.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO `tasks` (`title`, `description`, `due_date`, `created_at`, `updated_at`) VALUES ('File Tax Return', 'Use different free software to file tax return', '2016-03-27 20:00:00', '2017-03-26 18:43:49', '2017-03-26 18:43:49')

  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 4 LIMIT 1
UPDATE `tasks` SET `description` = '1. Add rich-editor functionalities to Description field\r\n\r\n2. Be careful security', `updated_at` = '2017-03-29 22:06:18' WHERE `tasks`.`id` = 4

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 2